Simulations/MEXICO/2018/V3/constant/turbineProperties/NRELPhaseVI
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbineProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

NumBl                   2;
TipRad                 5.029;//.0;
HubRad                  0.7;
UndSling                0.0;
OverHang               -1.469;
TowerHt                11.5;
Twr2Shft                0;
ShftTilt                0;
PreCone                (0 0);
GBRatio                25.13;
GenIner               143;
HubIner               71.926E3;
BladeIner             4.47E3;
RatedRotSpeed           5.0;
TorqueControllerType   "none";
YawControllerType      "none";
PitchControllerType    "none";
GenTorqueControllerType "none";
NacYawControllerType   "none";
BladePitchControllerType "none";
RotSpeedLimiter         false;
GenTorqueLimiter        true;
GenTorqueRateLimiter    true;
NacYawRateLimiter       false;
BladePitchRateLimiter   true;
SpeedFilterCornerFrequency  1.0;
GBEfficiency		1.0;
GenEfficiency		1.0;

GenTorqueControllerParams
{
    CutInGenSpeed           670.0;
    RatedGenSpeed          1173.7;
    Region2StartGenSpeed    871.0;
    Region2EndGenSpeed     1161.963;
    CutInGenTorque            0.0;
    RatedGenTorque           43.09355E3;
    RateLimitGenTorque       15.0E3;
    KGen                      2.55764E-2;
    TorqueControllerRelax     1.0;
}


BladePitchControllerParams
{
    PitchControlStartPitch    0.0;
    PitchControlEndPitch      7.6;
    PitchControlStartSpeed    15.77;
    PitchControlEndSpeed      16.0;
    RateLimitBladePitch       4.5;
}


NacYawControllerParams
{
    RateLimitNacYaw           2.0;
}

Airfoils
(
    "Cylinder1" 
    "Cylinder2" 
    "S809_RE550"  
    "S809_RE750"  

);


BladeData
(
//  radius(m)   c(m)     twist(deg) airfoil 
(	0.508	0.218	0	0	)
(	0.66	0.218	0	0	)
(	0.883	0.183	0	0	)
(	1.008	0.349	6.7	0	)
(	1.067	0.441	9.9	0	)
(	1.133	0.544	13.4	0	)
(	1.257	0.737	20.04	2	)
(	1.343	0.728	18.074	2	)
(	1.51	0.711	14.292	2	)
(	1.648	0.697	11.909	2	)
(	1.952	0.666	7.979	2	)
(	2.257	0.636	5.308	2	)
(	2.343	0.627	4.715	3	)
(	2.562	0.605	3.425	3	)
(	2.867	0.574	2.083	3	)
(	3.172	0.543	1.15	3	)
(	3.185	0.542	1.115	3	)
(	3.476	0.512	0.494	3	)
(	3.781	0.482	-0.015	3	)
(	4.023	0.457	-0.381	3	)
(	4.086	0.451	-0.475	3	)
(	4.391	0.42	-0.92	3	)
(	4.696	0.389	-1.352	3	)
(	4.78	0.381	-1.469	3	)
(	5	0.358	-1.775	3	)
(	5.305	0.328	-2.191	3	)
(	5.532	0.305	-2.5	3	)

);
